ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_usb.c
/**
  ******************************************************************************
  * @file    bl606p_usb.c
  * @version V1.0
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "bl606p_usb.h"

/** @addtogroup  BL606P_Peripheral_Driver
 *  @{
 */

/** @addtogroup  USB
 *  @{
 */

/** @defgroup  USB_Private_Macros
 *  @{
 */

/*@} end of group USB_Private_Macros */

/** @defgroup  USB_Private_Types
 *  @{
 */

/*@} end of group USB_Private_Types */

/** @defgroup  USB_Private_Variables
 *  @{
 */

/*@} end of group USB_Private_Variables */

/** @defgroup  USB_Global_Variables
 *  @{
 */

/*@} end of group USB_Global_Variables */

/** @defgroup  USB_Private_Fun_Declaration
 *  @{
 */

/*@} end of group USB_Private_Fun_Declaration */

/** @defgroup  USB_Private_Functions
 *  @{
 */

/*@} end of group USB_Private_Functions */

/** @defgroup  USB_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  USB global interrupt enable or disable
 *
 * @param  enable: ENABLE or DISABLE
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Global_IntEnable(uint8_t enable)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(USB_BASE, USB_DEV_CTL);

    if (enable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, USB_GLINT_EN_HOV);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, USB_GLINT_EN_HOV);
    }

    BL_WR_REG(USB_BASE, USB_DEV_CTL, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  USB global interrupt mask or unmask
 *
 * @param  intType: interrupt type
 * @param  intMask: MASK or UNMASK
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Global_IntMask(USB_GLOBAL_INT_Type intType, BL_Mask_Type intMask)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_USB_GLOBAL_INT_TYPE(intType));

    tmpVal = BL_RD_REG(USB_BASE, USB_GLB_INT);

    if (intMask == MASK) {
        tmpVal = tmpVal | (1 << intType);
    } else {
        tmpVal = tmpVal & ~(1 << intType);
    }

    BL_WR_REG(USB_BASE, USB_GLB_INT, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  get USB global interrupt status
 *
 * @param  intType: interrupt type
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type USB_Global_IntStatus(USB_GLOBAL_INT_Type intType)
{
    CHECK_PARAM(IS_USB_GLOBAL_INT_TYPE(intType));

    return (BL_RD_REG(USB_BASE, USB_GLB_ISR) & (1 << intType)) ? SET : RESET;
}

/****************************************************************************/ /**
 * @brief  set USB normal configuration
 *
 * @param  cfg: configuration
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Set_Normal_Config(USB_NORMAL_Cfg_Type *cfg)
{
    uint32_t tmpVal = 0;
    uint32_t to = 0;

    if (cfg->swRst) {
        tmpVal = BL_RD_REG(USB_BASE, USB_DEV_CTL);
        tmpVal = BL_SET_REG_BIT(tmpVal, USB_SFRST_HOV);
        BL_WR_REG(USB_BASE, USB_DEV_CTL, tmpVal);

        while (BL_GET_REG_BITS_VAL(BL_RD_REG(USB_BASE, USB_DEV_CTL), USB_SFRST_HOV)) {
            if (to >= cfg->rstTimeOut) {
                return ERROR;
            }

            to++;
        }
    }

    tmpVal = BL_RD_REG(USB_BASE, USB_DEV_CTL);

    if (cfg->forceFullSpeed) {
        tmpVal = BL_SET_REG_BIT(tmpVal, USB_FORCE_FS);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, USB_FORCE_FS);
    }

    if (cfg->remoteWakeupEn) {
        tmpVal = BL_SET_REG_BIT(tmpVal, USB_CAP_RMWAKUP);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CAP_RMWAKUP);
    }

    BL_WR_REG(USB_BASE, USB_DEV_CTL, tmpVal);

    tmpVal = BL_RD_REG(USB_BASE, USB_DEV_CTL);

    if (cfg->chipEn) {
        tmpVal = BL_SET_REG_BIT(tmpVal, USB_CHIP_EN_HOV);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CHIP_EN_HOV);
    }

    BL_WR_REG(USB_BASE, USB_DEV_CTL, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  get USB device speed
 *
 * @param  None
 *
 * @return high speed or full speed
 *
*******************************************************************************/
USB_DEVICE_SPEED_Type USB_Get_Device_Speed_Status(void)
{
    return (USB_DEVICE_SPEED_Type)BL_GET_REG_BITS_VAL(BL_RD_REG(USB_BASE, USB_DEV_CTL), USB_HS_EN_HOV);
}

/****************************************************************************/ /**
 * @brief  USB go suspend
 *
 * @param  enable: ENABLE or DISABLE
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Go_Suspend(uint8_t enable)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(USB_BASE, USB_DEV_CTL);

    if (enable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, USB_GOSUSP);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, USB_GOSUSP);
    }

    BL_WR_REG(USB_BASE, USB_DEV_CTL, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set USB device address
 *
 * @param  addr: address
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Set_Device_Address(uint8_t addr)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM((addr <= 127));

    tmpVal = BL_RD_REG(USB_BASE, USB_DEV_ADR);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_DEVADR, addr);
    BL_WR_REG(USB_BASE, USB_DEV_ADR, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  get USB device address
 *
 * @param  None
 *
 * @return address
 *
*******************************************************************************/
uint8_t USB_Get_Device_Address(void)
{
    return BL_GET_REG_BITS_VAL(BL_RD_REG(USB_BASE, USB_DEV_ADR), USB_DEVADR);
}

/****************************************************************************/ /**
 * @brief  USB non-control transfer enable
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Non_Ctrl_Transfer_Enable(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(USB_BASE, USB_DEV_ADR);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_AFT_CONF);
    BL_WR_REG(USB_BASE, USB_DEV_ADR, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  USB non-control transfer disable
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Non_Ctrl_Transfer_Disable(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(USB_BASE, USB_DEV_ADR);
    tmpVal = BL_CLR_REG_BIT(tmpVal, USB_AFT_CONF);
    BL_WR_REG(USB_BASE, USB_DEV_ADR, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  USB FIFO counters and location counters clear
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Clear_FIFO(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(USB_BASE, USB_DEV_TST);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_TST_CLRFF_HOV);
    BL_WR_REG(USB_BASE, USB_DEV_TST, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  USB SOF mask timer in high speed
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_SOF_Mask_Time_HighSpeed(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(USB_BASE, USB_DEV_SMT);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_SOFMT, USB_SOF_TIMER_MASK_AFTER_RESET_HS);
    BL_WR_REG(USB_BASE, USB_DEV_SMT, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  USB SOF mask timer in full speed
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_SOF_Mask_Time_FullSpeed(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(USB_BASE, USB_DEV_SMT);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_SOFMT, USB_SOF_TIMER_MASK_AFTER_RESET_FS);
    BL_WR_REG(USB_BASE, USB_DEV_SMT, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  USB SOF mask timer in full speed
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_SoftDetach_Enable(void)
{
    uint32_t tmpVal = 0;

