ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_usb.c
    regAddr = USB_BASE + USB_DEV_OUTMPS1_OFFSET + 0x04 * (epID - 1);

    tmpVal = BL_RD_WORD(regAddr);

    if (enable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, USB_STL_OEP1);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, USB_STL_OEP1);
    }

    BL_WR_WORD(regAddr, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set USB OUT endpoint max packet size
 *
 * @param  epID: endpoint number
 * @param  max: max packet size
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Set_Endpoint_OUT_MaxPacketSize(USB_Endpoint_Type epID, uint16_t max)
{
    uint32_t tmpVal = 0;
    uint32_t regAddr = 0;

    /* cannot be USB_Endpoint_0 */
    CHECK_PARAM(IS_USB_ENDPOINT_TYPE(epID));
    CHECK_PARAM((max <= 0x7FF));

    regAddr = USB_BASE + USB_DEV_OUTMPS1_OFFSET + 0x04 * (epID - 1);

    tmpVal = BL_RD_WORD(regAddr);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_MAXPS_OEP1, max);
    BL_WR_WORD(regAddr, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set USB FIFO ID of IN endpoint
 *
 * @param  epID: endpoint number
 * @param  fifoID: FIFO ID
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Set_FIFO_Of_Endpoint_IN(USB_Endpoint_Type epID, USB_FIFO_Type fifoID)
{
    uint32_t tmpVal = 0;
    uint32_t regAddr = 0;

    /* cannot be USB_Endpoint_0 */
    CHECK_PARAM(IS_USB_ENDPOINT_TYPE(epID));
    CHECK_PARAM(IS_USB_FIFO_TYPE(fifoID));

    if (epID <= USB_Endpoint_4) {
        regAddr = USB_BASE + USB_DEV_EPMAP0_OFFSET;
    } else {
        regAddr = USB_BASE + USB_DEV_EPMAP1_OFFSET;
    }

    tmpVal = BL_RD_WORD(regAddr);

    switch (epID) {
        case USB_Endpoint_1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_FNO_IEP1, fifoID);
            break;

        case USB_Endpoint_2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_FNO_IEP2, fifoID);
            break;

        case USB_Endpoint_3:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_FNO_IEP3, fifoID);
            break;

        case USB_Endpoint_4:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_FNO_IEP4, fifoID);
            break;

        case USB_Endpoint_5:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_FNO_IEP5, fifoID);
            break;

        case USB_Endpoint_6:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_FNO_IEP6, fifoID);
            break;

        case USB_Endpoint_7:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_FNO_IEP7, fifoID);
            break;

        case USB_Endpoint_8:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_FNO_IEP8, fifoID);
            break;

        default:
            break;
    }

    BL_WR_WORD(regAddr, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set USB FIFO ID of IN endpoint
 *
 * @param  epID: endpoint number
 * @param  fifoID: FIFO ID
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Set_FIFO_Of_Endpoint_OUT(USB_Endpoint_Type epID, USB_FIFO_Type fifoID)
{
    uint32_t tmpVal = 0;
    uint32_t regAddr = 0;

    /* cannot be USB_Endpoint_0 */
    CHECK_PARAM(IS_USB_ENDPOINT_TYPE(epID));
    CHECK_PARAM(IS_USB_FIFO_TYPE(fifoID));

    if (epID <= USB_Endpoint_4) {
        regAddr = USB_BASE + USB_DEV_EPMAP0_OFFSET;
    } else {
        regAddr = USB_BASE + USB_DEV_EPMAP1_OFFSET;
    }

    tmpVal = BL_RD_WORD(regAddr);

    switch (epID) {
        case USB_Endpoint_1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_FNO_OEP1, fifoID);
            break;

        case USB_Endpoint_2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_FNO_OEP2, fifoID);
            break;

        case USB_Endpoint_3:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_FNO_OEP3, fifoID);
            break;

        case USB_Endpoint_4:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_FNO_OEP4, fifoID);
            break;

        case USB_Endpoint_5:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_FNO_OEP5, fifoID);
            break;

        case USB_Endpoint_6:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_FNO_OEP6, fifoID);
            break;

        case USB_Endpoint_7:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_FNO_OEP7, fifoID);
            break;

        case USB_Endpoint_8:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_FNO_OEP8, fifoID);
            break;

        default:
            break;
    }

    BL_WR_WORD(regAddr, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set USB FIFO configuration
 *
 * @param  fifoID: FIFO ID
 * @param  cfg: configuration
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Set_FIFO_Config(USB_FIFO_Type fifoID, USB_FIFO_Cfg_Type *cfg)
{
    uint32_t tmpVal1 = 0;
    uint32_t tmpVal2 = 0;
    uint32_t en = 0;

    CHECK_PARAM(IS_USB_FIFO_TYPE(fifoID));
    CHECK_PARAM(IS_USB_FIFO_DIR_TYPE(cfg->dir));
    CHECK_PARAM(IS_USB_ENDPOINT_TYPE(cfg->epID));
    CHECK_PARAM(IS_USB_FIFO_BLOCK_MAX_SIZE_TYPE(cfg->blockSize));
    CHECK_PARAM(IS_USB_FIFO_BLOCK_CNT_TYPE(cfg->blockType));
    CHECK_PARAM(IS_USB_FIFO_TRANSFER_TYPE(cfg->fifoType));

    tmpVal1 = BL_RD_REG(USB_BASE, USB_DEV_FMAP);
    tmpVal2 = BL_RD_REG(USB_BASE, USB_DEV_FCFG);

    if (cfg->enable) {
        en = 1;
    }

    switch (fifoID) {
        case USB_FIFO_0:
            tmpVal1 = BL_SET_REG_BITS_VAL(tmpVal1, USB_DIR_FIFO0, cfg->dir);
            tmpVal1 = BL_SET_REG_BITS_VAL(tmpVal1, USB_EPNO_FIFO0, cfg->epID);
            tmpVal2 = BL_SET_REG_BITS_VAL(tmpVal2, USB_EN_F0, en);
            tmpVal2 = BL_SET_REG_BITS_VAL(tmpVal2, USB_BLKSZ_F0, cfg->blockSize);
            tmpVal2 = BL_SET_REG_BITS_VAL(tmpVal2, USB_BLKNO_F0, cfg->blockType);
            tmpVal2 = BL_SET_REG_BITS_VAL(tmpVal2, USB_BLK_TYP_F0, cfg->fifoType);
            break;

        case USB_FIFO_1:
            tmpVal1 = BL_SET_REG_BITS_VAL(tmpVal1, USB_DIR_FIFO1, cfg->dir);
            tmpVal1 = BL_SET_REG_BITS_VAL(tmpVal1, USB_EPNO_FIFO1, cfg->epID);
            tmpVal2 = BL_SET_REG_BITS_VAL(tmpVal2, USB_EN_F1, en);
            tmpVal2 = BL_SET_REG_BITS_VAL(tmpVal2, USB_BLKSZ_F1, cfg->blockSize);
            tmpVal2 = BL_SET_REG_BITS_VAL(tmpVal2, USB_BLKNO_F1, cfg->blockType);
            tmpVal2 = BL_SET_REG_BITS_VAL(tmpVal2, USB_BLK_TYP_F1, cfg->fifoType);
            break;

        case USB_FIFO_2:
            tmpVal1 = BL_SET_REG_BITS_VAL(tmpVal1, USB_DIR_FIFO2, cfg->dir);
            tmpVal1 = BL_SET_REG_BITS_VAL(tmpVal1, USB_EPNO_FIFO2, cfg->epID);
            tmpVal2 = BL_SET_REG_BITS_VAL(tmpVal2, USB_EN_F2, en);
            tmpVal2 = BL_SET_REG_BITS_VAL(tmpVal2, USB_BLKSZ_F2, cfg->blockSize);
            tmpVal2 = BL_SET_REG_BITS_VAL(tmpVal2, USB_BLKNO_F2, cfg->blockType);
            tmpVal2 = BL_SET_REG_BITS_VAL(tmpVal2, USB_BLK_TYP_F2, cfg->fifoType);
            break;

