ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_usb.c
    BL_WR_REG(USB_BASE, USB_DEV_MIGR, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  get USB group interrupt status
 *
 * @param  intType: interrupt type
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type USB_Group_IntStatus(USB_GRP_INT_Type intType)
{
    CHECK_PARAM(IS_USB_GRP_INT_TYPE(intType));

    return (BL_RD_REG(USB_BASE, USB_DEV_IGR) & (1 << intType)) ? SET : RESET;
}

/****************************************************************************/ /**
 * @brief  USB mask sub group interrupt
 *
 * @param  intType: interrupt type, USB_INT_CX_SETUP | USB_INT_CX_IN | ...
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Sub_Group_IntMask(uint64_t intType)
{
    uint64_t val = intType;
    uint32_t bit = 0;
    uint32_t tmpValG0 = BL_RD_WORD(USB_BASE + USB_DEV_MISG0_OFFSET);
    uint32_t tmpValG1 = BL_RD_WORD(USB_BASE + USB_DEV_MISG1_OFFSET);
    uint32_t tmpValG2 = BL_RD_WORD(USB_BASE + USB_DEV_MISG2_OFFSET);
    uint32_t tmpValG3 = BL_RD_WORD(USB_BASE + USB_DEV_MISG3_OFFSET);
    uint32_t tmpValG4 = BL_RD_WORD(USB_BASE + USB_DEV_MISG4_OFFSET);

    while (0 == arch_ctzll(&val, &bit)) {
        val &= ~(((uint64_t)1) << bit);
        switch (bit) {
            case USB_SUB_GRP0_INT_CX_SETUP:
                tmpValG0 |= (1 << USB_MCX_SETUP_INT_POS);
                break;
            case USB_SUB_GRP0_INT_CX_IN:
                tmpValG0 |= (1 << USB_MCX_IN_INT_POS);
                break;
            case USB_SUB_GRP0_INT_CX_OUT:
                tmpValG0 |= (1 << USB_MCX_OUT_INT_POS);
                break;
            case USB_SUB_GRP0_INT_CX_COMFAIL:
                tmpValG0 |= (1 << USB_MCX_COMFAIL_INT_POS);
                break;
            case USB_SUB_GRP0_INT_CX_COMABORT:
                tmpValG0 |= (1 << USB_MCX_COMABORT_INT_POS);
                break;
            case USB_SUB_GRP1_INT_F0_OUT:
                tmpValG1 |= (1 << USB_MF0_OUT_INT_POS);
                break;
            case USB_SUB_GRP1_INT_F0_SPK:
                tmpValG1 |= (1 << USB_MF0_SPK_INT_POS);
                break;
            case USB_SUB_GRP1_INT_F1_OUT:
                tmpValG1 |= (1 << USB_MF1_OUT_INT_POS);
                break;
            case USB_SUB_GRP1_INT_F1_SPK:
                tmpValG1 |= (1 << USB_MF1_SPK_INT_POS);
                break;
            case USB_SUB_GRP1_INT_F2_OUT:
                tmpValG1 |= (1 << USB_MF2_OUT_INT_POS);
                break;
            case USB_SUB_GRP1_INT_F2_SPK:
                tmpValG1 |= (1 << USB_MF2_SPK_INT_POS);
                break;
            case USB_SUB_GRP1_INT_F3_OUT:
                tmpValG1 |= (1 << USB_MF3_OUT_INT_POS);
                break;
            case USB_SUB_GRP1_INT_F3_SPK:
                tmpValG1 |= (1 << USB_MF3_SPK_INT_POS);
                break;
            case USB_SUB_GRP1_INT_F0_IN:
                tmpValG1 |= (1 << USB_MF0_IN_INT_POS);
                break;
            case USB_SUB_GRP1_INT_F1_IN:
                tmpValG1 |= (1 << USB_MF1_IN_INT_POS);
                break;
            case USB_SUB_GRP1_INT_F2_IN:
                tmpValG1 |= (1 << USB_MF2_IN_INT_POS);
                break;
            case USB_SUB_GRP1_INT_F3_IN:
                tmpValG1 |= (1 << USB_MF3_IN_INT_POS);
                break;
            case USB_SUB_GRP2_INT_RESET:
                tmpValG2 |= (1 << USB_MUSBRST_INT_POS);
                break;
            case USB_SUB_GRP2_INT_SUSPEND:
                tmpValG2 |= (1 << USB_MSUSP_INT_POS);
                break;
            case USB_SUB_GRP2_INT_RESUME:
                tmpValG2 |= (1 << USB_MRESM_INT_POS);
                break;
            case USB_SUB_GRP2_INT_TX0BYTE:
                tmpValG2 |= (1 << USB_MTX0BYTE_INT_POS);
                break;
            case USB_SUB_GRP2_INT_RX0BYTE:
                tmpValG2 |= (1 << USB_MRX0BYTE_INT_POS);
                break;
            case USB_SUB_GRP2_INT_DMA_CMPLT:
                tmpValG2 |= (1 << USB_MDMA_CMPLT_HOV_POS);
                break;
            case USB_SUB_GRP2_INT_DMA_ERROR:
                tmpValG2 |= (1 << USB_MDMA_ERROR_HOV_POS);
                break;
            case USB_SUB_GRP2_INT_IDLE:
                tmpValG2 |= (1 << USB_MDEV_IDLE_HOV_POS);
                break;
            case USB_SUB_GRP2_INT_WAKEUP_BY_VBUS:
                tmpValG2 |= (1 << USB_MDEV_WAKEUP_BYVBUS_POS);
                break;
            case USB_SUB_GRP3_INT_VDMA_CMPLT_CXF:
                tmpValG3 |= (1 << USB_MVDMA_CMPLT_CXF_POS);
                break;
            case USB_SUB_GRP3_INT_VDMA_CMPLT_F0:
                tmpValG3 |= (1 << USB_MVDMA_CMPLT_F0_POS);
                break;
            case USB_SUB_GRP3_INT_VDMA_CMPLT_F1:
                tmpValG3 |= (1 << USB_MVDMA_CMPLT_F1_POS);
                break;
            case USB_SUB_GRP3_INT_VDMA_CMPLT_F2:
                tmpValG3 |= (1 << USB_MVDMA_CMPLT_F2_POS);
                break;
            case USB_SUB_GRP3_INT_VDMA_CMPLT_F3:
                tmpValG3 |= (1 << USB_MVDMA_CMPLT_F3_POS);
                break;
            case USB_SUB_GRP3_INT_VDMA_ERROR_CXF:
                tmpValG3 |= (1 << USB_MVDMA_ERROR_CXF_POS);
                break;
            case USB_SUB_GRP3_INT_VDMA_ERROR_F0:
                tmpValG3 |= (1 << USB_MVDMA_ERROR_F0_POS);
                break;
            case USB_SUB_GRP3_INT_VDMA_ERROR_F1:
                tmpValG3 |= (1 << USB_MVDMA_ERROR_F1_POS);
                break;
            case USB_SUB_GRP3_INT_VDMA_ERROR_F2:
                tmpValG3 |= (1 << USB_MVDMA_ERROR_F2_POS);
                break;
            case USB_SUB_GRP3_INT_VDMA_ERROR_F3:
                tmpValG3 |= (1 << USB_MVDMA_ERROR_F3_POS);
                break;
            case USB_SUB_GRP4_INT_L1:
                tmpValG4 |= (1 << USB_ML1_INT_POS);
                break;
            default:
                break;
        }
    }
    BL_WR_WORD(USB_BASE + USB_DEV_MISG0_OFFSET, tmpValG0);
    BL_WR_WORD(USB_BASE + USB_DEV_MISG1_OFFSET, tmpValG1);
    BL_WR_WORD(USB_BASE + USB_DEV_MISG2_OFFSET, tmpValG2);
    BL_WR_WORD(USB_BASE + USB_DEV_MISG3_OFFSET, tmpValG3);
    BL_WR_WORD(USB_BASE + USB_DEV_MISG4_OFFSET, tmpValG4);
    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  USB unmask sub group interrupt
 *
 * @param  intType: interrupt type, USB_INT_CX_SETUP | USB_INT_CX_IN | ...
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Sub_Group_IntUnmask(uint64_t intType)
{
    uint64_t val = intType;
    uint32_t bit = 0;
    uint32_t tmpValG0 = BL_RD_WORD(USB_BASE + USB_DEV_MISG0_OFFSET);
    uint32_t tmpValG1 = BL_RD_WORD(USB_BASE + USB_DEV_MISG1_OFFSET);
    uint32_t tmpValG2 = BL_RD_WORD(USB_BASE + USB_DEV_MISG2_OFFSET);
    uint32_t tmpValG3 = BL_RD_WORD(USB_BASE + USB_DEV_MISG3_OFFSET);
    uint32_t tmpValG4 = BL_RD_WORD(USB_BASE + USB_DEV_MISG4_OFFSET);

